package Lesson_1;

public class Lesson1 {
    public static void main(String[] args) {



    }

    //        РЎРѕР·РґР°С‚СЊ РїРµСЂРµРјРµРЅРЅС‹Рµ РІСЃРµС… РїСЂРѕР№РґРµРЅРЅС‹С… С‚РёРїРѕРІ РґР°РЅРЅС‹С…, Рё РёРЅРёС†РёР°Р»РёР·РёСЂРѕРІР°С‚СЊ РёС… Р·РЅР°С‡РµРЅРёСЏ;
    private static void peremennye() {
        byte b1 = -3;
        short s1 = 2022;
        int i1 = 45655;
        long l1 = 84848444L;
        float f1 = 78.45f;
        double d1 = -789.546;
        char c1 = 'f';
        boolean b2 = true;
        String str = "Ok";
    }

    //        РќР°РїРёСЃР°С‚СЊ РјРµС‚РѕРґ РІС‹С‡РёСЃР»СЏСЋС‰РёР№ РІС‹СЂР°Р¶РµРЅРёРµ a * (b + (c / d)) Рё РІРѕР·РІСЂР°С‰Р°СЋС‰РёР№ СЂРµР·СѓР»СЊС‚Р°С‚,
    //        РіРґРµ a, b, c, d вЂ“ РІС…РѕРґРЅС‹Рµ РїР°СЂР°РјРµС‚СЂС‹ СЌС‚РѕРіРѕ РјРµС‚РѕРґР°;
    private static int evaluateExpression() {
        int a = 54, b = 7, c = 10, d = 2;
        return a * (b + (c / d));

    }

    //      РќР°РїРёСЃР°С‚СЊ РјРµС‚РѕРґ, РїСЂРёРЅРёРјР°СЋС‰РёР№ РЅР° РІС…РѕРґ РґРІР° С‡РёСЃР»Р°, Рё РїСЂРѕРІРµСЂСЏСЋС‰РёР№ С‡С‚Рѕ РёС… СЃСѓРјРјР° Р»РµР¶РёС‚ РІ РїСЂРµРґРµР»Р°С…
    //       РѕС‚ 10 РґРѕ 20(РІРєР»СЋС‡РёС‚РµР»СЊРЅРѕ), РµСЃР»Рё РґР° вЂ“ РІРµСЂРЅСѓС‚СЊ true, РІ РїСЂРѕС‚РёРІРЅРѕРј СЃР»СѓС‡Р°Рµ вЂ“ false;
    private static boolean chekSumma(String[] args) {
        int a1 = 8, b1 = 15;
        int sum = a1 + b1;
        if (sum >= 10 && sum <= 20) {
            return true;
        } else {
            return false;
        }

    }

    //      РќР°РїРёСЃР°С‚СЊ РјРµС‚РѕРґ, РєРѕС‚РѕСЂРѕРјСѓ РІ РєР°С‡РµСЃС‚РІРµ РїР°СЂР°РјРµС‚СЂР° РїРµСЂРµРґР°РµС‚СЃСЏ С†РµР»РѕРµ С‡РёСЃР»Рѕ, РјРµС‚РѕРґ РґРѕР»Р¶РµРЅ РЅР°РїРµС‡Р°С‚Р°С‚СЊ
    //      РІ РєРѕРЅСЃРѕР»СЊ РїРѕР»РѕР¶РёС‚РµР»СЊРЅРѕРµ Р»Рё С‡РёСЃР»Рѕ РїРµСЂРµРґР°Р»Рё, РёР»Рё РѕС‚СЂРёС†Р°С‚РµР»СЊРЅРѕРµ; Р—Р°РјРµС‡Р°РЅРёРµ: РЅРѕР»СЊ СЃС‡РёС‚Р°РµРј
    //      РїРѕР»РѕР¶РёС‚РµР»СЊРЅС‹Рј С‡РёСЃР»РѕРј.
    private static void chekZnakChisla(String[] args) {
        int a = -7;
        if (a >= 0) {
            System.out.println("Р§РёСЃР»Рѕ РїРѕР»РѕР¶РёС‚РµР»СЊРЅРѕРµ");
        } else {
            System.out.println("Р§РёСЃР»Рѕ РѕС‚СЂРёС†Р°С‚РµР»СЊРЅРѕРµ");
        }

    }

    //      РќР°РїРёСЃР°С‚СЊ РјРµС‚РѕРґ, РєРѕС‚РѕСЂРѕРјСѓ РІ РєР°С‡РµСЃС‚РІРµ РїР°СЂР°РјРµС‚СЂР° РїРµСЂРµРґР°РµС‚СЃСЏ С†РµР»РѕРµ С‡РёСЃР»Рѕ,
    //      РјРµС‚РѕРґ РґРѕР»Р¶РµРЅ РІРµСЂРЅСѓС‚СЊ true, РµСЃР»Рё С‡РёСЃР»Рѕ РѕС‚СЂРёС†Р°С‚РµР»СЊРЅРѕРµ;
    private static boolean chekNumber() {
        int bsd = 5;
        if (bsd < 0) {
            return true;

        }
        return false;
    }
    //    РќР°РїРёСЃР°С‚СЊ РјРµС‚РѕРґ, РєРѕС‚РѕСЂРѕРјСѓ РІ РєР°С‡РµСЃС‚РІРµ РїР°СЂР°РјРµС‚СЂР° РїРµСЂРµРґР°РµС‚СЃСЏ СЃС‚СЂРѕРєР°, РѕР±РѕР·РЅР°С‡Р°СЋС‰Р°СЏ РёРјСЏ,
    //    РјРµС‚РѕРґ РґРѕР»Р¶РµРЅ РІС‹РІРµСЃС‚Рё РІ РєРѕРЅСЃРѕР»СЊ СЃРѕРѕР±С‰РµРЅРёРµ В«РџСЂРёРІРµС‚, СѓРєР°Р·Р°РЅРЅРѕРµ_РёРјСЏ!В»;
    private static void privetName(String imy) {
        System.out.println("РџСЂРёРІРµС‚, "+imy+"!");


    }
    /* РќР°РїРёСЃР°С‚СЊ РјРµС‚РѕРґ, РєРѕС‚РѕСЂС‹Р№ РѕРїСЂРµРґРµР»СЏРµС‚ СЏРІР»СЏРµС‚СЃСЏ Р»Рё РіРѕРґ РІРёСЃРѕРєРѕСЃРЅС‹Рј, Рё РІС‹РІРѕРґРёС‚ СЃРѕРѕР±С‰РµРЅРёРµ РІ РєРѕРЅСЃРѕР»СЊ.
    РљР°Р¶РґС‹Р№ 4-Р№ РіРѕРґ СЏРІР»СЏРµС‚СЃСЏ РІРёСЃРѕРєРѕСЃРЅС‹Рј, РєСЂРѕРјРµ РєР°Р¶РґРѕРіРѕ 100-РіРѕ, РїСЂРё СЌС‚РѕРј РєР°Р¶РґС‹Р№ 400-Р№ вЂ“ РІРёСЃРѕРєРѕСЃРЅС‹Р№.
     */
    public static void visokosGod(String[] args) {
        int god= 2003;
        if (god % 4 ==0 || god % 400 ==0 ) {
            if (god % 100 ==0) System.out.println("+");
            else
                System.out.println("-");

        }
    }
}