package Lesson_1;

public class Lesson1 {
    public static void main(String[] args) {
        System.out.println("Home Work");
//        Создать переменные всех пройденных типов данных, и инициализировать их значения;
        byte b1 = -3;
        short s1 = 2022;
        int i1 = 45655;
        long l1 = 84848444L;
        float f1 = 78.45f;
        double d1 = -789.546;
        char c1 = 'f';
        boolean b2 = true;
        String str = "Ok";

//        Написать метод вычисляющий выражение a * (b + (c / d)) и возвращающий результат,
//        где a, b, c, d – входные параметры этого метода;
        System.out.println("1");
    }
}
